# Ayiti Analytics Probability and Statistics Project

Use all the files to have a final datasets to have the following columns
   <ul>
    <li>questid</li>
    <li>gender</li>
    <li>age (age of applicant)</li>
    <li>communeName (use data prep in commune file)</li>
    <li>application_date (created at in quest file)</li>
    <li>enroll_date (created_at in enroll file)</li>
    <li>is_enroll (Yes/No) (use data prep in enroll file)</li>
    <li>Education Level</li>
   <li>Communication channels(hear_AA1)</li>
    <li>Bootcamp Insterest (after_AA)</li>
    <li>Payement Date (use ord and transaction files)</li>
    <li>Payed (Yes/No)</li>
    <li>list Technologies as columns based (use get_dummies)</li>
    <li>list  Study domains (use get_dummies)</li>
    <li>Job is formal</li>
    <li>Have computer at home</li>
    <li>Have internet at home</li>
    
   </ul>

## Import of libraries

In [214]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import shapiro

## Retrieving Data File

In [128]:
commune_data       = pd.read_excel('commune.xlsx', index_col=0)
enroll_data        = pd.read_csv('enroll.csv', index_col=0)
industry_data      = pd.read_csv('industry.csv', index_col=0)
ord_data           = pd.read_csv('ord.csv', index_col=0)
quest_data         = pd.read_csv('quest.csv', index_col=0)
study_domain_data  = pd.read_csv('study_domain.csv', index_col=0)
technology_data    = pd.read_csv('technology.csv', index_col=0)
transaction_data   = pd.read_csv('transaction.csv', index_col=0)

### Clean Commune Data File

In [129]:
commune_data.head(2)

                Commune_FR Commune_Id  Departement ADM1_PCODE
Commune_en
Abricots          Abricots     HT0812  Grande'Anse       HT08
Acul du Nord  Acul du Nord     HT0321        North       HT03

In [130]:
#Select necessary columns
commune_data = commune_data.loc[:,['Commune_FR', 'Commune_Id']]

#Rename selected columns for a better use
commune_data.columns = ['commune_name','commune_id']

#set the index
commune_data = commune_data.set_index('commune_id')

In [131]:
commune_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 140 entries, HT0812 to HT0532
Data columns (total 1 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   commune_name  140 non-null    object
dtypes: object(1)
memory usage: 2.2+ KB

In [132]:
commune_data.head(2)

            commune_name
commune_id
HT0812          Abricots
HT0321      Acul du Nord

### Clean Quest Data File

In [133]:
quest_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 250 entries, 0 to 249
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   gender              250 non-null    object
 1   dob                 244 non-null    object
 2   commune             250 non-null    object
 3   created_at          250 non-null    object
 4   modified_at         250 non-null    object
 5   department          249 non-null    object
 6   education_level     250 non-null    object
 7   university          250 non-null    object
 8   study_domain        250 non-null    object
 9   current_employed    250 non-null    object
 10  formal_sector_job   250 non-null    object
 11  have_computer_home  250 non-null    object
 12  internet_at_home    250 non-null    object
 13  hear_AA_1           250 non-null    object
 14  after_AA            250 non-null    object
 15  quest_id            250 non-null    object
dtypes: object(16)
memory usage: 33.2+ KB

In [134]:
###Drop unwanted column
quest_data.drop(columns=['modified_at','department','university','study_domain','current_employed'], inplace=True)

###Rename columns for better use
quest_data.columns = ['gender','dob','commune_id','application_date','education_level',
                      'formal_sector_job','have_computer_home','internet_at_home',
                      'communication_channels','bootcamp_insterest','quest_id']
###Replace wrong dob format
quest_data['dob'] = quest_data['dob'].replace(['3 aout 1977'],'03/08/1977')
###Convert column dob to datetime 
quest_data['dob'] = pd.to_datetime(quest_data['dob'])
quest_data['application_date'] = pd.to_datetime(quest_data['application_date'])
###Fill Null Values with the average value
quest_data.dob = quest_data['dob'].fillna(value=quest_data.dob.mean())
#set the data in quest.commune_id to upper
quest_data['commune_id'] = quest_data['commune_id'].str.upper()

quest_data = quest_data.set_index('commune_id')

In [135]:
quest_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 250 entries, HT0111 to HT1012
Data columns (total 10 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   gender                  250 non-null    object
 1   dob                     250 non-null    datetime64[ns]
 2   application_date        250 non-null    datetime64[ns, UTC]
 3   education_level         250 non-null    object
 4   formal_sector_job       250 non-null    object
 5   have_computer_home      250 non-null    object
 6   internet_at_home        250 non-null    object
 7   communication_channels  250 non-null    object
 8   bootcamp_insterest      250 non-null    object
 9   quest_id                250 non-null    object
dtypes: datetime64[ns, UTC](1), datetime64[ns](1), object(8)
memory usage: 21.5+ KB

In [136]:
f_merge = pd.merge(left =commune_data,right=quest_data,how="inner",on="commune_id")
f_merge.info()

<class 'pandas.core.frame.DataFrame'>
Index: 250 entries, HT0731 to HT0532
Data columns (total 11 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   commune_name            250 non-null    object
 1   gender                  250 non-null    object
 2   dob                     250 non-null    datetime64[ns]
 3   application_date        250 non-null    datetime64[ns, UTC]
 4   education_level         250 non-null    object
 5   formal_sector_job       250 non-null    object
 6   have_computer_home      250 non-null    object
 7   internet_at_home        250 non-null    object
 8   communication_channels  250 non-null    object
 9   bootcamp_insterest      250 non-null    object
 10  quest_id                250 non-null    object
dtypes: datetime64[ns, UTC](1), datetime64[ns](1), object(9)
memory usage: 23.4+ KB

### Clean Ord Data File

In [137]:
# Creating the payment column 
ord_data['paid']= 'yes'
ord_data=ord_data.loc[:,['created_at','user_id','paid']]
ord_data.head(2)

                 created_at   user_id paid
0  2021-03-14T15:34:35.014Z  41587952  yes
1  2021-03-14T04:20:23.483Z  41564742  yes

### Setting up Transanctio Data File

In [138]:
transaction_data['paid'] = 'yes'
transaction_data = transaction_data.loc[:,['created_at','user_id','paid']]
transaction_data.head(2)

                 created_at   user_id paid
0  2021-03-08T05:08:50.832Z  40976440  yes
1  2021-03-08T17:26:35.841Z  41179271  yes

In [139]:
#Concat Transaction and Ord Data File
trans_ord=pd.concat([transaction_data,ord_data], axis=0)
trans_ord=trans_ord.rename(columns={'created_at':'payment_date'})
trans_ord

                payment_date   user_id paid
0   2021-03-08T05:08:50.832Z  40976440  yes
1   2021-03-08T17:26:35.841Z  41179271  yes
2   2021-03-08T18:52:09.147Z  40973512  yes
3   2021-03-08T19:06:32.837Z  41177453  yes
4   2021-03-08T22:10:00.796Z  40797121  yes
..                       ...       ...  ...
13  2021-02-18T14:45:02.292Z  39908510  yes
14  2021-02-17T13:48:38.371Z  39903501  yes
15  2021-02-17T11:08:54.385Z  39896120  yes
16  2021-02-16T20:09:31.627Z  39856539  yes
17  2021-01-05T04:00:41.222Z  34856150  yes

[78 rows x 3 columns]

In [140]:
##Setting up enroll file
enroll_data = enroll_data.rename(columns={'created_at':'enroll_date'})
enroll_data = enroll_data.loc[:,['enroll_date','user_id','quest_id']]
enroll_data['is_enroll']='yes'
enroll_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148 entries, 0 to 147
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   enroll_date  148 non-null    object
 1   user_id      148 non-null    int64
 2   quest_id     102 non-null    object
 3   is_enroll    148 non-null    object
dtypes: int64(1), object(3)
memory usage: 5.8+ KB

In [141]:
#Second merge between the concatenation result of Transaction and Ord Data File and Enroll Data File
S_merge = pd.merge(left =trans_ord,right=enroll_data,how="right",on="user_id")
S_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   payment_date  77 non-null     object
 1   user_id       148 non-null    int64
 2   paid          77 non-null     object
 3   enroll_date   148 non-null    object
 4   quest_id      102 non-null    object
 5   is_enroll     148 non-null    object
dtypes: int64(1), object(5)
memory usage: 8.1+ KB

In [142]:
#Merge the Fisrt dataset and the second one
dataset = pd.merge(left =f_merge,right=S_merge,how="left",on="quest_id")
dataset=dataset.drop(columns='user_id')
dataset['is_enroll']= dataset['is_enroll'].fillna('no')
dataset['paid']= dataset['paid'].fillna('no')

In [143]:
#Function that calculate age from Date of birth 
from datetime import datetime, date
def age(dob):
    today = date.today()
    return today.year - dob.year - ((today.month,today.day)< (dob.month,dob.day))

In [144]:
dataset['age'] = dataset['dob'].apply(age)
dataset.loc[:,['dob','age']]

           dob  age
0   1995-12-05   25
1   1995-09-16   25
2   1987-04-19   34
3   1991-09-08   29
4   1987-02-22   34
..         ...  ...
245 1988-09-17   32
246 1997-11-23   23
247 1980-12-04   40
248 1984-01-22   37
249 1985-03-28   36

[250 rows x 2 columns]

In [145]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 250 entries, 0 to 249
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   commune_name            250 non-null    object
 1   gender                  250 non-null    object
 2   dob                     250 non-null    datetime64[ns]
 3   application_date        250 non-null    datetime64[ns, UTC]
 4   education_level         250 non-null    object
 5   formal_sector_job       250 non-null    object
 6   have_computer_home      250 non-null    object
 7   internet_at_home        250 non-null    object
 8   communication_channels  250 non-null    object
 9   bootcamp_insterest      250 non-null    object
 10  quest_id                250 non-null    object
 11  payment_date            65 non-null     object
 12  paid                    250 non-null    object
 13  enroll_date             102 non-null    object
 14  is_enroll               250 non-null    object
 15  age                     250 non-null    int64
dtypes: datetime64[ns, UTC](1), datetime64[ns](1), int64(1), object(13)
memory usage: 33.2+ KB

In [146]:
#List of study domain using get_dummies methode to trnasforme row to column 
study_domain = pd.get_dummies(data=study_domain_data[["quest_id", "values"]], columns=['values'],prefix ="",prefix_sep="",dtype=int)
study_domain =study_domain.groupby("quest_id").sum()
study_domain.head(2)

,Accounting,Computer Science,Economics,Electrical Engineering,Law,Management,Medicine,Statistics,other
quest_id,,,,,,,,,
905ddcf2-ce95-11eb-9a92-7c67a234f601,0,0,0,0,0,0,0,0,1
905e4cf5-ce95-11eb-96a9-7c67a234f601,0,1,0,0,0,1,0,0,0

In [147]:
study_domain.columns

Index(['Accounting', 'Computer Science', 'Economics', 'Electrical Engineering',
       'Law', 'Management', 'Medicine', 'Statistics', 'other'],
      dtype='object')

In [148]:
#List of technologies using get_dummies methode to trnasforme row to column
technology = pd.get_dummies(data=technology_data[["quest_id", "values"]], columns=['values'],prefix ="",prefix_sep="",dtype=int)
technology = technology.groupby("quest_id").sum()
technology.head(2)

,Bash,Excel,Git,Java,JavaScript,PHP,PowerBI or Tableau,Python,R,SQL,VBA,other
quest_id,,,,,,,,,,,,
905ddcf2-ce95-11eb-9a92-7c67a234f601,0,1,0,0,0,0,0,0,1,0,0,0
905e2608-ce95-11eb-809f-7c67a234f601,1,1,1,1,1,0,0,1,0,1,0,0

In [149]:
technology.columns

Index(['Bash', 'Excel', 'Git', 'Java', 'JavaScript', 'PHP',
       'PowerBI or Tableau', 'Python', 'R', 'SQL', 'VBA', 'other'],
      dtype='object')

In [150]:
dataset_tt = pd.merge(left =dataset,right=technology,how="outer",on="quest_id")
dataset_tt = pd.merge(left =dataset_tt,right=study_domain,how="outer",on="quest_id")

In [151]:
dataset_tt.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 250 entries, 0 to 249
Data columns (total 37 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   commune_name            250 non-null    object
 1   gender                  250 non-null    object
 2   dob                     250 non-null    datetime64[ns]
 3   application_date        250 non-null    datetime64[ns, UTC]
 4   education_level         250 non-null    object
 5   formal_sector_job       250 non-null    object
 6   have_computer_home      250 non-null    object
 7   internet_at_home        250 non-null    object
 8   communication_channels  250 non-null    object
 9   bootcamp_insterest      250 non-null    object
 10  quest_id                250 non-null    object
 11  payment_date            65 non-null     object
 12  paid                    250 non-null    object
 13  enroll_date             102 non-null    object
 14  is_enroll               250 non-null    object
 15  age                     250 non-null    int64
 16  Bash                    244 non-null    float64
 17  Excel                   244 non-null    float64
 18  Git                     244 non-null    float64
 19  Java                    244 non-null    float64
 20  JavaScript              244 non-null    float64
 21  PHP                     244 non-null    float64
 22  PowerBI or Tableau      244 non-null    float64
 23  Python                  244 non-null    float64
 24  R                       244 non-null    float64
 25  SQL                     244 non-null    float64
 26  VBA                     244 non-null    float64
 27  other_x                 244 non-null    float64
 28  Accounting              244 non-null    float64
 29  Computer Science        244 non-null    float64
 30  Economics               244 non-null    float64
 31  Electrical Engineering  244 non-null    float64
 32  Law                     244 non-null    float64
 33  Management              244 non-null    float64
 34  Medicine                244 non-null    float64
 35  Statistics              244 non-null    float64
 36  other_y                 244 non-null    float64
dtypes: datetime64[ns, UTC](1), datetime64[ns](1), float64(21), int64(1), object(13)
memory usage: 74.2+ KB

In [152]:
dataset_tt = dataset_tt.drop(columns=['other_y','other_x'])

In [153]:
dataset_tt.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 250 entries, 0 to 249
Data columns (total 35 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   commune_name            250 non-null    object
 1   gender                  250 non-null    object
 2   dob                     250 non-null    datetime64[ns]
 3   application_date        250 non-null    datetime64[ns, UTC]
 4   education_level         250 non-null    object
 5   formal_sector_job       250 non-null    object
 6   have_computer_home      250 non-null    object
 7   internet_at_home        250 non-null    object
 8   communication_channels  250 non-null    object
 9   bootcamp_insterest      250 non-null    object
 10  quest_id                250 non-null    object
 11  payment_date            65 non-null     object
 12  paid                    250 non-null    object
 13  enroll_date             102 non-null    object
 14  is_enroll               250 non-null    object
 15  age                     250 non-null    int64
 16  Bash                    244 non-null    float64
 17  Excel                   244 non-null    float64
 18  Git                     244 non-null    float64
 19  Java                    244 non-null    float64
 20  JavaScript              244 non-null    float64
 21  PHP                     244 non-null    float64
 22  PowerBI or Tableau      244 non-null    float64
 23  Python                  244 non-null    float64
 24  R                       244 non-null    float64
 25  SQL                     244 non-null    float64
 26  VBA                     244 non-null    float64
 27  Accounting              244 non-null    float64
 28  Computer Science        244 non-null    float64
 29  Economics               244 non-null    float64
 30  Electrical Engineering  244 non-null    float64
 31  Law                     244 non-null    float64
 32  Management              244 non-null    float64
 33  Medicine                244 non-null    float64
 34  Statistics              244 non-null    float64
dtypes: datetime64[ns, UTC](1), datetime64[ns](1), float64(19), int64(1), object(13)
memory usage: 70.3+ KB

In [182]:
cols=dataset_tt.iloc[:,16:].columns
for i in cols:
    dataset_tt[i]= dataset_tt[i].fillna(0.0)
dataset_tt.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 250 entries, 0 to 249
Data columns (total 35 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   commune_name            250 non-null    object
 1   gender                  250 non-null    object
 2   dob                     250 non-null    datetime64[ns]
 3   application_date        250 non-null    datetime64[ns, UTC]
 4   education_level         250 non-null    object
 5   formal_sector_job       250 non-null    object
 6   have_computer_home      250 non-null    object
 7   internet_at_home        250 non-null    object
 8   communication_channels  250 non-null    object
 9   bootcamp_insterest      250 non-null    object
 10  quest_id                250 non-null    object
 11  payment_date            65 non-null     object
 12  paid                    250 non-null    object
 13  enroll_date             102 non-null    object
 14  is_enroll               250 non-null    object
 15  age                     250 non-null    int64
 16  Bash                    250 non-null    float64
 17  Excel                   250 non-null    float64
 18  Git                     250 non-null    float64
 19  Java                    250 non-null    float64
 20  JavaScript              250 non-null    float64
 21  PHP                     250 non-null    float64
 22  PowerBI or Tableau      250 non-null    float64
 23  Python                  250 non-null    float64
 24  R                       250 non-null    float64
 25  SQL                     250 non-null    float64
 26  VBA                     250 non-null    float64
 27  Accounting              250 non-null    float64
 28  Computer Science        250 non-null    float64
 29  Economics               250 non-null    float64
 30  Electrical Engineering  250 non-null    float64
 31  Law                     250 non-null    float64
 32  Management              250 non-null    float64
 33  Medicine                250 non-null    float64
 34  Statistics              250 non-null    float64
dtypes: datetime64[ns, UTC](1), datetime64[ns](1), float64(19), int64(1), object(13)
memory usage: 70.3+ KB

In [183]:
dataset_tt.shape

(250, 35)

###  1. How many observations and variables are there in the dataset

In [205]:
# here your codes
print('1.1-. The number of observations found in the dataset are',dataset_tt.shape[0])
print('1.2-. The number of variables found in the dataset are',dataset_tt.shape[1])

1.1-. The number of observations found in the dataset are 250
1.2-. The number of variables found in the dataset are 35

### 2.A Calculate the average age of the observations
   * On the whole dataset
   * On the whole male dataset
   * On all the female dataset
### 2.B Calculate 
   * variance of the whole datatset,male and female
   * kurtosis of the whole datatset,male and female
   * skewness of the whole datatset,male and female
### 2.C Does the age distribution follow a normal distribution

In [216]:
# here your codes
print('---------------2.A-. Average---------------')
average_age = dataset_tt['age'].mean()
print('2.1-. The average age of the whole dataset is ',int(average_age))

average_male_age = dataset_tt[dataset_tt['gender']=='male']['age'].mean()
print('2.2-. The average age of male gender is ',int(average_male_age))

average_female_age = dataset_tt[dataset_tt['gender']=='female']['age'].mean()
print('2.3-. The average age of female is ',int(average_female_age))

print('---------------2.B-. Variance---------------')
age_var = dataset_tt['age'].var()
print('2.1-. The variance age of the whole dataset is ',age_var)

var_male_age = dataset_tt[dataset_tt['gender']=='male']['age'].var()
print('2.2-. The variance age of male gender is ',var_male_age)

var_female_age = dataset_tt[dataset_tt['gender']=='female']['age'].var()
print('2.3-. The variance age of female is ',var_female_age)

print('---------------2.B.a-. Kurtosis---------------')
age_kurtosis = dataset_tt['age'].kurtosis()
print('2.1-. The kurtosis of age of the whole dataset is ',age_kurtosis)

kurt_male_age = dataset_tt[dataset_tt['gender']=='male']['age'].kurtosis()
print('2.2-. The kurtosis of age of male gender is ',kurt_male_age)

kurt_female_age = dataset_tt[dataset_tt['gender']=='female']['age'].kurtosis()
print('2.3-. The kurtosis of age of female is ',kurt_female_age)

print('---------------2.B.b-. Skewness---------------')
age_skew = dataset_tt['age'].skew()
print('2.1-. The Skewness of age of the whole dataset is ',age_skew)

skew_male_age = dataset_tt[dataset_tt['gender']=='male']['age'].skew()
print('2.2-. The Skewness of age of male gender is ',skew_male_age)

skew_female_age = dataset_tt[dataset_tt['gender']=='female']['age'].skew()
print('2.3-. The Skewness of age of female is ',skew_female_age)

print('---------------2.C-. Check Normal Distribution---------------')
'''To check if the distribution is normal, applying a statistics test is one of the to prove it's normality or not
Shapiro-Wilk test: This test is used to assess the normality of data'''

print("2.1-. Shapiro-Wilk Test for The whole dataset: ",shapiro(dataset_tt['age']))
print("2.2-. Shapiro-Wilk Test for Female Sample: ",shapiro(dataset_tt[dataset_tt['gender']=='female']['age']))
print("2.3-. Shapiro-Wilk Test for Male Sample: ",shapiro(dataset_tt[dataset_tt['gender']=='male']['age']))

---------------2.A-. Average---------------
2.1-. The average age of the whole dataset is  26
2.2-. The average age of male gender is  27
2.3-. The average age of female is  25
---------------2.B-. Variance---------------
2.1-. The variance age of the whole dataset is  50.863116465863456
2.2-. The variance age of male gender is  49.33814563722381
2.3-. The variance age of female is  56.209065679926
---------------2.B.a-. Kurtosis---------------
2.1-. The kurtosis of age of the whole dataset is  5.218606799858623
2.2-. The kurtosis of age of male gender is  5.4560984948185105
2.3-. The kurtosis of age of female is  5.2188791757717246
---------------2.B.b-. Skewness---------------
2.1-. The Skewness of age of the whole dataset is  -0.6804444532655722
2.2-. The Skewness of age of male gender is  -0.6532037990221373
2.3-. The Skewness of age of female is  -0.7761252492973681
---------------2.C-. Check Normal Distribution---------------
2.1-. Shapiro-Wilk Test for The whole dataset:  ShapiroResult(statistic=0.8535417318344116, pvalue=1.173012306455697e-14)
2.2-. Shapiro-Wilk Test for Female Sample:  ShapiroResult(statistic=0.8135976195335388, pvalue=3.2467153232573764e-06)
2.3-. Shapiro-Wilk Test for Male Sample:  ShapiroResult(statistic=0.8596307635307312, pvalue=1.0059737331341578e-12)

### 3.Display the age frequency disbrution
   * On the whole dataset
   * On the whole male dataset
   * On all the female dataset

In [251]:
dataset_tt.loc[:,['gender','age']].groupby(by='age').count()

     gender
age
-1        2
 0        4
 1        1
 19       2
 20       4
 21       7
 22      20
 23      19
 24      22
 25      28
 26      25
 27      23
 28      14
 29      12
 30      14
 31       5
 32      10
 33       7
 34       7
 35       2
 36       1
 37       5
 38       3
 39       2
 40       4
 44       2
 45       2
 46       1
 49       1
 51       1

### 4. Can we say that the average age (24 years old) of the observations can be considered as the average age of the population likely to participate in this bootcamp. Justify your answer

In [156]:
#here your codes

### 5. Calculate the average age of participants for each communication channel

In [157]:
#here your codes

### 6. Display an age boxplot for each communication channel

In [158]:
#here your codes

### 7 .Is there a significant age difference between these groups

In [159]:
#here your codes

### 8.Plan a BA strategy for each communication channel regarding the age group

In [160]:
#here your codes

### 9.According to the observations what is the probability of being in each channel of communication knowing your are a woman

In [161]:
#here your codes

### 10.According to the observations what is the probability of being in each channel of communication knowing your are a man

In [162]:
#here your codes

### 11. Deduce the probability of being a woman knowing each communication channel

In [163]:
#here your codes

### 13. Deduce the probability of being a woman knowing each communication channel

In [164]:
# here your codes

### 14. Deduce the probability of being a man knowing each communication channel

In [165]:

#here your codes

### 15 Display a plot to see Gender vs Communication Channels .Is there any dependency between communication channels and gender?

In [166]:
#here

### 16 Use the same method to display plot and know if is there any dependency between communication channels and Bootcamp Insterest?

In [167]:
# here your codes

### 17.Plan a BA  strategy for each communication channel, Bootcamp Insterest regarding the gender

In [168]:
#here your codes

### 18.Plan a BA  strategy for each communication channel, Bootcamp Insterest regarding the gender

In [169]:
# here your codes

### 19. Calculate 
    * P(Bootcamp Insterest,Communication channels,Gender/Payed=yes)
    * P(Bootcamp Insterest,Communication channels,Gender/Payed=no)

### 20 reduce 
* P(Payed="yes"/Bootcamp Insterest="Increase Skill",Communication channels="Friend",Gender="male")
* P(Payed="no"/Bootcamp Insterest="Increase Skill",Communication channels="Friend",Gender="male")

In [170]:
# here your codes

### Based on these findings, propose strategies to increase our sales?

In [171]:
#here your codes